# Domain – HR 
## focus – Insights from data

In [144]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [145]:
salary = pd.read_csv(r'C:\Users\nimesh.yadav\Desktop\Python\Module_5\574_m5_datasets_v3.0\Salaries.csv',dtype={'Agency':str},low_memory=False)
salary.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [146]:
salary.drop(['Agency','Status','Notes'],inplace=True,axis = 1)
salary.fillna(0)
salary.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011

##  1. Compute how much total salary cost has increased from year 2011 to 2014

In [147]:
yearly = salary.groupby('Year')
yearly_pay = yearly['TotalPayBenefits'].sum()
initial = (yearly_pay[2011]/1000000).round(2)
ending = (yearly_pay[2014]/1000000).round(2)
print(f"""Salary cost has increased from {initial} Millions in year 2011 to {ending} Millions in year 2014,
which is {(ending-initial).round(2)} Millions more than 2011 """)

Salary cost has increased from 2594.11 Millions in year 2011 to 3821.87 Millions in year 2014,
which is 1227.76 Millions more than 2011

### Enhancement
2. In year 2014 OverTimePay was what percentage of  TotalPayBenefits

In [148]:
overtime = yearly['OvertimePay'].sum()
overtimepay = (overtime[2014]/1000000).round(2)
print(f"OverTimePay was {(overtimepay/ending*100).round(2)} % of TotalPayBenefits ")

OverTimePay was 5.39 % of TotalPayBenefits

## 2. Which Job Title in Year 2014 has highest mean salary?
### Enhancements :
3. Which Job Title in Year 2014 has lowest mean salary

In [149]:
job = salary[salary['Year'] == 2014][['JobTitle','TotalPayBenefits']]
job.head()

                        JobTitle  TotalPayBenefits
110529            Deputy Chief 3         510732.68
110530         Asst Med Examiner         479652.21
110531  Chief Investment Officer         436224.36
110532           Chief of Police         418019.22
110533    Chief, Fire Department         417435.10

In [150]:
job_group = job.groupby('JobTitle')['TotalPayBenefits']
job_mean = job_group.mean()
print("Highest Mean Salay for Year 2014 : ")
print(job_mean.idxmax()," : ", job_mean.max())
print("\n\n")
print("Lowest Mean Salay for Year 2014 : ")
print(job_mean.idxmin()," : ",job_mean.min())

Highest Mean Salay for Year 2014 :
Chief Investment Officer  :  436224.36



Lowest Mean Salay for Year 2014 :
BdComm Mbr, Grp2,M=$25/Mtg  :  345.4175555555555

## 3. How much money could have been saved in Year 2014 by stopping OverTimePay?

In [152]:
overtime = salary[salary['Year'] == 2014]['OvertimePay']
print(f"{overtime.sum()/1000000} Millions could have been saved by stopping OverTimePay .")

205.91859927 Millions could have been saved by stopping OverTimePay .

## 4. Which are the top 5 common job in Year 2014 and how much do they cost SFO ?

In [153]:
jobs_count = job_group.size()
print("Top 5 common Jobs in 2014 are :")
common = jobs_count.nlargest(5).reset_index(name = 'No. of Jobs')
common

Top 5 common Jobs in 2014 are :

                       JobTitle  No. of Jobs
0              Transit Operator         2479
1                 Special Nurse         1478
2              Registered Nurse         1234
3  Public Svc Aide-Public Works          916
4                   Firefighter          815

In [156]:
totalpays = job_group.sum()
total_cost = 0
for i in common['JobTitle']:
   total_cost += totalpays[i]
print(f"Top 5 common jobs cost SFO {total_cost/1000000} Millions")

Top 5 common jobs cost SFO 610.2692276600003 Millions

###  Enhancement
1. Which are the last 5 common job in Year 2014 and how much do they cost SFO

In [157]:
last_five = jobs_count.nsmallest(5).reset_index(name = 'No. of Jobs')
last_five

                      JobTitle  No. of Jobs
0  ACPO,JuvP, Juv Prob (SFERS)            1
1                Acupuncturist            1
2     Adm, SFGH Medical Center            1
3   Administrative Hearing Sup            1
4           Administrator, DPH            1

In [158]:
totalpays = job_group.sum()
total_cost = 0
for i in last_five['JobTitle']:
   total_cost += totalpays[i]
print(f"Last 5 common jobs cost SFO {total_cost/1000000} Millions")

Last 5 common jobs cost SFO 1.03780476 Millions

## 5. Who was the top earning employee across all the years?

In [162]:
print("Top earning employee across all years is :")
salary[salary['TotalPayBenefits']== salary['TotalPayBenefits'].max()]

Top earning employee across all years is :

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011